In [1]:
import numpy as np
import pandas as pd

In [6]:
# This the data on which we are working for analysis.
# data is reference 
# The keys of the dictionary are the DataFrameâ€™s column labels, and the
# dictionary values are the data values in the corresponding DataFrame
# columns.

data = {
    "name": ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
    "city": ['Mexico city', 'Toronto', 'Prague', 'Shanghai',                                            'Manchester', 'Cairo', 'Osaka'],
    "age": [41, 28, 33, 34, 38, 31, 37],
    "py_score": [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84],
}
 
raw_lables = [101, 102, 103, 104, 105, 106, 107]

In [8]:
df = pd.DataFrame(data=data, index=raw_lables, columns=['age', 'name', 'py_score', 'city'])
df

     age    name  py_score         city
101   41  Xavier      88.0  Mexico city
102   28     Ann      79.0      Toronto
103   33    Jana      81.0       Prague
104   34      Yi      80.0     Shanghai
105   38   Robin      68.0   Manchester
106   31    Amal      61.0        Cairo
107   37    Nori      84.0        Osaka

In [13]:
df.head(n=2)

       name         city  age  py-score
101  Xavier  Mexico city   41      88.0
102     Ann      Toronto   28      79.0

In [16]:
df.tail(n=2)

     name   city  age  py_score
106  Amal  Cairo   31      61.0
107  Nori  Osaka   37      84.0

In [36]:
cities = df['age']
type(cities[106])

numpy.int64

In [34]:
location_103 = df.loc[103]
type(location_103['py_score'])

numpy.float64

### Creating a Pandas DataFrame With Dictionaries

In [21]:
d = {
    'a': [1,2,3],
    'b': np.array([888,999,0]),
    'c': 123,
}

In [22]:
df = pd.DataFrame(d)

In [23]:
df

   a    b    c
0  1  888  123
1  2  999  123
2  3    0  123

In [28]:
pd.DataFrame(data=d, index=[0,1,2], columns=['c','b','a'])

     c    b  a
0  123  888  1
1  123  999  2
2  123    0  3

In [31]:
arr = np.arange(10).reshape(2,5)
arr

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [32]:
df = pd.DataFrame(arr)

In [33]:
df

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [35]:
df

       name         city  age  py_score
101  Xavier  Mexico city   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [2]:
df.dtypes

NameError: name 'df' is not defined

In [41]:
data = [[1,2,3],
        [4,5,6],
        [7,8,9]]
data_fr = pd.DataFrame(data,columns=['x','y','z'])
data_fr

   x  y  z
0  1  2  3
1  4  5  6
2  7  8  9

In [89]:
array = np.arange(1,21).reshape(4,5)

In [90]:
# copy_array = array.copy()
df = pd.DataFrame(array,copy=True)
df

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20

In [91]:
array[0,0] = 100

In [92]:
df

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20